Revit 2024 API
EnergyAnalysisConstruction.IsSchematic Property
 Indicates if this originates from a schematic or analytical construction.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool IsSchematic { get; }
Visual Basic
Public ReadOnly Property IsSchematic As Boolean
	Get
Visual C++
public:
property bool IsSchematic {
	bool get ();
}
See Also
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace